import datetime

from django.db    import models
from django.utils import timezone

"""
--------------------------------------------------------------------------
質問テーブル
--------------------------------------------------------------------------
"""
class Question(models.Model):
    """
    ----------------------------------------------------------------------
    インスタンス変数
    ----------------------------------------------------------------------
    テーブルカラムのモデルを定義

    question_text: 質問文
    pub_date     : 公開日時
    ----------------------------------------------------------------------
    """
    question_text = models.CharField(max_length = 200)
    pub_date      = models.DateTimeField('date_published')

    """
    ----------------------------------------------------------------------
    出力文定義関数
    ----------------------------------------------------------------------

    質問文を出力

    ----------------------------------------------------------------------
    """
    def __str__(self):
        return self.question_text

    """
    ----------------------------------------------------------------------
    最近公開されたかどうかを判定する関数
    ----------------------------------------------------------------------

    返り値：TRUE (関数を実行した時間から１日引いた時間より後に作られた質問の場合),
    　　　　FALSE(そうでない場合)

    ----------------------------------------------------------------------
    """
    def was_published_recently(self):
        now = timezone.now()
        return now - datetime.timedelta(days=1) <= self.pub_date <= now

 
"""
--------------------------------------------------------------------------
選択肢テーブル
--------------------------------------------------------------------------
"""
class Choice(models.Model):
    """
    ----------------------------------------------------------------------
    インスタンス変数
    ----------------------------------------------------------------------
    テーブルカラムのモデルを定義
    
    question    : 質問ID
    choice_text : 選択肢
    votes       : 投票数
    ----------------------------------------------------------------------
    """
    question    = models.ForeignKey(Question, on_delete=models.CASCADE)
    choice_text = models.CharField(max_length=200)
    votes       = models.IntegerField(default=0)

    """
    ----------------------------------------------------------------------
    出力文定義関数
    ----------------------------------------------------------------------

    選択肢を出力

    ----------------------------------------------------------------------
    """
    def __str__(self):
        return self.choice_text

